In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']

In [3]:
labels

['a', 'b', 'c']

In [4]:
my_data = [10,20,30]

In [5]:
arr = np.array([56,89,68])

In [6]:
d = {'x':56,'y':89,'z':795}

# Series (1D)

In [7]:
ser1 = pd.Series(data=my_data)

In [8]:
ser1

0    10
1    20
2    30
dtype: int64

In [9]:
type(ser1)

pandas.core.series.Series

In [10]:
ser2 = pd.Series(data=my_data,index=labels)

In [11]:
ser2

a    10
b    20
c    30
dtype: int64

In [12]:
ser3 = pd.Series(arr)

In [13]:
ser3

0    56
1    89
2    68
dtype: int32

In [14]:
ser4 = pd.Series(d)

In [15]:
ser4

x     56
y     89
z    795
dtype: int64

In [16]:
ser4.shape

(3,)

# Dataframes

In [17]:
np.random.randint(1,100,20).reshape(5,4)

array([[19, 62, 92, 55],
       [35, 55, 57, 18],
       [18, 91, 43, 66],
       [12, 53, 12, 71],
       [84, 61, 92, 53]])

In [18]:
df = pd.DataFrame(np.random.randint(1,100,20).reshape(5,4),columns=['dany','surbhi','dhanshree','aarti'],index=['z','r','t','y','u'])

In [19]:
df

   dany  surbhi  dhanshree  aarti
z    11      43          6     81
r    86      81         15     36
t    93      77         82     89
y    49      46         37     29
u     2      86         85     20

In [20]:
df1 = pd.read_csv('sat.csv')

In [21]:
df1

     SAT   GPA
0   1714  2.40
1   1664  2.52
2   1760  2.54
3   1685  2.74
4   1693  2.83
..   ...   ...
79  1936  3.71
80  1810  3.71
81  1987  3.73
82  1962  3.76
83  2050  3.81

[84 rows x 2 columns]

In [22]:
df.shape

(5, 4)

In [23]:
df1.shape

(84, 2)

In [24]:
df

   dany  surbhi  dhanshree  aarti
z    11      43          6     81
r    86      81         15     36
t    93      77         82     89
y    49      46         37     29
u     2      86         85     20

In [25]:
df['dany']

z    11
r    86
t    93
y    49
u     2
Name: dany, dtype: int32

In [26]:
df[['dany','surbhi']]

   dany  surbhi
z    11      43
r    86      81
t    93      77
y    49      46
u     2      86

In [27]:
df[['dany','surbhi','aarti']]

   dany  surbhi  aarti
z    11      43     81
r    86      81     36
t    93      77     89
y    49      46     29
u     2      86     20

In [28]:
df

   dany  surbhi  dhanshree  aarti
z    11      43          6     81
r    86      81         15     36
t    93      77         82     89
y    49      46         37     29
u     2      86         85     20

In [29]:
df['chetna'] = [56,78,34,67,9]

In [30]:
df

   dany  surbhi  dhanshree  aarti  chetna
z    11      43          6     81      56
r    86      81         15     36      78
t    93      77         82     89      34
y    49      46         37     29      67
u     2      86         85     20       9

In [31]:
df['deepak'] = df['aarti']+df['chetna']

In [32]:
df

   dany  surbhi  dhanshree  aarti  chetna  deepak
z    11      43          6     81      56     137
r    86      81         15     36      78     114
t    93      77         82     89      34     123
y    49      46         37     29      67      96
u     2      86         85     20       9      29

In [33]:
# (rows ====> 0,columns====> 1)

In [34]:
df.drop(['deepak'],axis=1)

   dany  surbhi  dhanshree  aarti  chetna
z    11      43          6     81      56
r    86      81         15     36      78
t    93      77         82     89      34
y    49      46         37     29      67
u     2      86         85     20       9

In [35]:
df

   dany  surbhi  dhanshree  aarti  chetna  deepak
z    11      43          6     81      56     137
r    86      81         15     36      78     114
t    93      77         82     89      34     123
y    49      46         37     29      67      96
u     2      86         85     20       9      29

In [36]:
df.drop(['deepak'],axis=1,inplace=True)

In [37]:
df

   dany  surbhi  dhanshree  aarti  chetna
z    11      43          6     81      56
r    86      81         15     36      78
t    93      77         82     89      34
y    49      46         37     29      67
u     2      86         85     20       9

In [38]:
df

   dany  surbhi  dhanshree  aarti  chetna
z    11      43          6     81      56
r    86      81         15     36      78
t    93      77         82     89      34
y    49      46         37     29      67
u     2      86         85     20       9

In [39]:
df.drop(['chetna'],axis=1,inplace=True)

In [40]:
df

   dany  surbhi  dhanshree  aarti
z    11      43          6     81
r    86      81         15     36
t    93      77         82     89
y    49      46         37     29
u     2      86         85     20

In [41]:
df

   dany  surbhi  dhanshree  aarti
z    11      43          6     81
r    86      81         15     36
t    93      77         82     89
y    49      46         37     29
u     2      86         85     20

In [42]:
# Row data revert (loc===>name ,iloc===>index location)

In [43]:
df.loc['r']

dany         86
surbhi       81
dhanshree    15
aarti        36
Name: r, dtype: int32

In [44]:
df.loc[['z','u']]

   dany  surbhi  dhanshree  aarti
z    11      43          6     81
u     2      86         85     20

In [45]:
df

   dany  surbhi  dhanshree  aarti
z    11      43          6     81
r    86      81         15     36
t    93      77         82     89
y    49      46         37     29
u     2      86         85     20

In [47]:
df.iloc[1]

dany         86
surbhi       81
dhanshree    15
aarti        36
Name: r, dtype: int32

In [48]:
df.iloc[1:4]

   dany  surbhi  dhanshree  aarti
r    86      81         15     36
t    93      77         82     89
y    49      46         37     29

In [49]:
df

   dany  surbhi  dhanshree  aarti
z    11      43          6     81
r    86      81         15     36
t    93      77         82     89
y    49      46         37     29
u     2      86         85     20

In [50]:
df.iloc[2:4]

   dany  surbhi  dhanshree  aarti
t    93      77         82     89
y    49      46         37     29

In [51]:
df.iloc[[2,3]]

   dany  surbhi  dhanshree  aarti
t    93      77         82     89
y    49      46         37     29

In [52]:
df

   dany  surbhi  dhanshree  aarti
z    11      43          6     81
r    86      81         15     36
t    93      77         82     89
y    49      46         37     29
u     2      86         85     20

In [54]:
#df.iloc[row_start:row_end,col_start:col_end]
df.iloc[0:2,0:2]

   dany  surbhi
z    11      43
r    86      81

In [56]:
df.iloc[1:4,0:3]

   dany  surbhi  dhanshree
r    86      81         15
t    93      77         82
y    49      46         37

In [57]:
df

   dany  surbhi  dhanshree  aarti
z    11      43          6     81
r    86      81         15     36
t    93      77         82     89
y    49      46         37     29
u     2      86         85     20

In [58]:
df.drop(['y'],axis=0)

   dany  surbhi  dhanshree  aarti
z    11      43          6     81
r    86      81         15     36
t    93      77         82     89
u     2      86         85     20